In [39]:
import numpy as n
import pandas as pd
import matplotlib.pyplot as plt
from sklearn.cluster import AgglomerativeClustering, DBSCAN, KMeans, SpectralClustering
from sklearn.mixture import GaussianMixture
from sklearn.preprocessing import MinMaxScaler
from sklearn.metrics import silhouette_score

In [30]:
data = pd.read_csv(r"C:\Users\Nare\Downloads\Mall_Customers.csv")

In [31]:
data

     CustomerID  Gender  Age  Annual Income (k$)  Spending Score (1-100)
0             1    Male   19                  15                      39
1             2    Male   21                  15                      81
2             3  Female   20                  16                       6
3             4  Female   23                  16                      77
4             5  Female   31                  17                      40
..          ...     ...  ...                 ...                     ...
195         196  Female   35                 120                      79
196         197  Female   45                 126                      28
197         198    Male   32                 126                      74
198         199    Male   32                 137                      18
199         200    Male   30                 137                      83

[200 rows x 5 columns]

In [32]:
data['Gender'] = (data['Gender'] == 'Male' ).astype('int8')
data

     CustomerID  Gender  Age  Annual Income (k$)  Spending Score (1-100)
0             1       1   19                  15                      39
1             2       1   21                  15                      81
2             3       0   20                  16                       6
3             4       0   23                  16                      77
4             5       0   31                  17                      40
..          ...     ...  ...                 ...                     ...
195         196       0   35                 120                      79
196         197       0   45                 126                      28
197         198       1   32                 126                      74
198         199       1   32                 137                      18
199         200       1   30                 137                      83

[200 rows x 5 columns]

In [33]:
data = data.drop('CustomerID', axis = 1)
data

     Gender  Age  Annual Income (k$)  Spending Score (1-100)
0         1   19                  15                      39
1         1   21                  15                      81
2         0   20                  16                       6
3         0   23                  16                      77
4         0   31                  17                      40
..      ...  ...                 ...                     ...
195       0   35                 120                      79
196       0   45                 126                      28
197       1   32                 126                      74
198       1   32                 137                      18
199       1   30                 137                      83

[200 rows x 4 columns]

In [34]:
ob = MinMaxScaler()
data = pd.DataFrame(ob.fit_transform(data), columns = data.columns, index = data.index)

In [35]:
data

     Gender       Age  Annual Income (k$)  Spending Score (1-100)
0       1.0  0.019231            0.000000                0.387755
1       1.0  0.057692            0.000000                0.816327
2       0.0  0.038462            0.008197                0.051020
3       0.0  0.096154            0.008197                0.775510
4       0.0  0.250000            0.016393                0.397959
..      ...       ...                 ...                     ...
195     0.0  0.326923            0.860656                0.795918
196     0.0  0.519231            0.909836                0.275510
197     1.0  0.269231            0.909836                0.744898
198     1.0  0.269231            1.000000                0.173469
199     1.0  0.230769            1.000000                0.836735

[200 rows x 4 columns]

In [36]:
X=data

# KMeans

In [9]:
kmeans = KMeans(n_clusters=7, random_state=0, n_init="auto")
y_pred = kmeans.fit_predict(X)

In [10]:
centers = kmeans.cluster_centers_

In [12]:
sklearn_score = silhouette_score(X, y_pred)

In [13]:
sklearn_score

0.38382882420184655

# AgglomerativeClustering

In [25]:
model = AgglomerativeClustering(n_clusters=5, linkage='complete')
y_pred = model.fit_predict(X)
sklearn_score = silhouette_score(X, y_pred)

In [26]:
sklearn_score

0.30316439293019537

# GMM

In [37]:
gmm_sk = GaussianMixture(n_components=4, random_state=42)
gmm_sk.fit(X)
y_pred = gmm_sk.predict(X)
sklearn_score = silhouette_score(X, y_pred)
sklearn_score

0.36093546864504156

# DBSCAN

In [41]:
model = DBSCAN(eps=0.73, min_samples=3)
y_pred = model.fit_predict(X)
sklearn_score = silhouette_score(X, y_pred)
sklearn_score

0.5194624832665107